app/controllers/inspections_controller.rb

SELECT "inspections".* FROM "inspections"
---
  def index
    @inspections = Inspection.all