app/controllers/patients_controller.rb

INSERT INTO "patients" ("type_document_cd", "document_number", "firstname", "lastname", "observations", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_patient
      @patient = Patient.find(params[:id])